bundles/org.openhab.binding.ihc/src/test/resources/ResourceValueQueryResponse88888.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getRuntimeValue2 xmlns:ns1="utcs" xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">88888</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string">resource_time</ns1:typeString>

<ns1:value xmlns:ns2="utcs.values"  xsi:type="ns2:WSTimeValue">
<ns2:hours xsi:type="xsd:int">16</ns2:hours>

<ns2:minutes xsi:type="xsd:int">32</ns2:minutes>

<ns2:seconds xsi:type="xsd:int">45</ns2:seconds>
</ns1:value>
</ns1:getRuntimeValue2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>